Documents/ЛБ_Доверенности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_Доверенности</Name>
			<BasedOn>
				<xr:Item>Document.ЛБ_ОперацияПоЗалогу</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_Доверенности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДоверенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДоверенностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоверенности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияДоверенности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийДоверенность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтзываемаяДоверенность</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_Доверенности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПредставителяКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_LX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоВыдачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОНотариуса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_Доверенности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_Доверенности</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусДоверенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыДоверенностей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийДоверенность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_Доверенности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_КлиентыВПеречнях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КлиентыВПеречнях</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПроверкиПеречней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПеречней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПеречня</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВключенияВПеречень</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусКлиентаВПеречне</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыКлиентаВПеречнях</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СоответствиеКлиентовИСотрудниковОрганизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийДоверенность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийДоверенность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отзыв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыДоверенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДоверенностей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нотариальная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Письменная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОСмерти</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийОперацияПоЗалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийОперацияПоЗалогу</Name>
			<Comment>Виды операций документа "Операция по залогу"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
					<Comment>Выдача займа под залог</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзъятиеОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПереоформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановкаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиСОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзъятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВозвратаИзъятого</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОстановкиНачисленияПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыЗалоговыхБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыЗалоговыхБилетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвественноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВНакладную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъявленТорг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправкеОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыПеречней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыПеречней</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Террористы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФРОМУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыКлиентаВПеречнях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыКлиентаВПеречнях</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исключен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_Доверенности/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Сербаев 06.07.2023 Для выведения полного наименования реквизитов ДокументКлиента и ДокументПредставителяКлиента 
// созданы реквизиты формы с типом строка (ДокументКлиентаПолноеНаименование и ДокументПредставителяКлиентаПолноеНаименование).
	  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Если Параметры.Свойство("ВидОперации") тогда    
			Объект.ВидОперации = Параметры.ВидОперации;
			Элементы.ВидОперации.ТолькоПросмотр = Истина;
		КонецЕсли;	                                                    
		Если Параметры.Свойство("Клиент") тогда
			Объект.Клиент = Параметры.Клиент;  			
		КонецЕсли;	 
		
		//+МАН 23.04.25 Решили, что должен подтягиваться текущий ломбард, в котором доверенность выдается или аннулируется. Заявка 2956
		Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
			Объект.Ломбард = ПараметрыСеанса.ТекущийЛомбард;
		Иначе
			Объект.Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		КонецЕсли;
		//-МАН
		
		Если Параметры.Свойство("ЗалоговыйБилет") тогда
			Объект.ЗалоговыйБилет = Параметры.ЗалоговыйБилет;  
			//+МАН 23.04.25 Решили, что должен подтягиваться текущий ломбард, в котором доверенность выдается или аннулируется. Заявка 2956
			//Было: Объект.Ломбард = Объект.ЗалоговыйБилет.Ломбард;   
			//-МАН
			Объект.ДокументКлиента = Объект.ЗалоговыйБилет.ДокументЗалогодателя;
            // ++ Сербаев 06.07.2023
			ДокументКлиентаПолноеНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЗалоговыйБилет.ДокументЗалогодателя, "НаименованиеПолное");
            // -- Сербаев 06.07.2023
		КонецЕсли; 
		Если Параметры.Свойство("Доверенность") тогда
			Объект.ОтзываемаяДоверенность = Параметры.Доверенность;  
			УстановитьРеквизитыПоДоверенности();
			Элементы.ОтзываемаяДоверенность.ТолькоПросмотр = Истина;
        КонецЕсли;
	КонецЕсли;	
	Если ЗначениеЗаполнено(Объект.ЗалоговыйБилет) Тогда  		
		Элементы.ЗалоговыйБилет.ТолькоПросмотр = Истина;
	КонецЕсли;  
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		Элементы.Клиент.ТолькоПросмотр = Истина; 
		Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(Объект.Клиент, Объект.Дата) = неопределено Тогда 
			Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство;  
			Элементы.ВидОперации.ТолькоПросмотр = Истина;
		КонецЕсли;	
	КонецЕсли;   
	//Если ЗначениеЗаполнено(Объект.ДокументКлиента) Тогда
	//	Элементы.ДокументКлиента.ТолькоПросмотр = Истина;
	//КонецЕсли;  
	Если Параметры.ТолькоПросмотр = Истина тогда 
		Этаформа.ТолькоПросмотр = Параметры.ТолькоПросмотр;
	КонецЕсли;	

	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		Объект.Дата = ТекущаяДата(); 
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	    Если НЕ ТекПользователь.ЭтоЛомбард Тогда
       		Объект.Ответственный = ТекПользователь;
		Иначе
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		КонецЕсли;	
		Объект.Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
      	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.ПустаяСсылка() Тогда
		    Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Оформление;
		КонецЕсли;	   
		Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Оформление Тогда
			Объект.ВидДоверенности = Перечисления.ЛБ_ВидыДоверенностей.Письменная;
			Объект.ДатаДоверенности = НачалоДня(Объект.Дата);
			Объект.СрокДействияДоверенности = ДобавитьМесяц(Объект.ДатаДоверенности, 13);   
		ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда
	        Объект.ВидДоверенности = Перечисления.ЛБ_ВидыДоверенностей.СвидетельствоОСмерти;  
		КонецЕсли;
	КонецЕсли;
	
	УстановитьСостояниеДокумента(); 
	УстановитьДоступностьПоВидуОперации();
	УстановитьДоступность();
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);   
	//Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Оформление Тогда
	//    ИсторияДоверенности.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	//Иначе
	//	ИсторияДоверенности.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.ОтзываемаяДоверенность.Ссылка);
	//КонецЕсли;	   
	
	Запрос = Новый Запрос;  
	СрокОкончанияДействия = Дата(1,1,1); 
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Оформление ИЛИ Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда
        Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		СрокОкончанияДействия = Объект.СрокДействияДоверенности;
	Иначе
		Запрос.УстановитьПараметр("Ссылка", Объект.ОтзываемаяДоверенность.Ссылка);
	КонецЕсли;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Доверенности.Период КАК Дата,
	               |	ЛБ_Доверенности.СтатусДоверенности КАК Событие,
	               |	ЛБ_Доверенности.Ответственный КАК Ответственный
	               |ИЗ
	               |	РегистрСведений.ЛБ_Доверенности КАК ЛБ_Доверенности
	               |ГДЕ
	               |	ЛБ_Доверенности.Доверенность = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_Доверенности.Период";
	ИсторияДоверенности.Загрузить(Запрос.Выполнить().Выгрузить());
	Если НЕ СрокОкончанияДействия = Дата(1,1,1) И СрокОкончанияДействия < НачалоДня(ТекущаяДата()) Тогда 
		 СтрИ = ИсторияДоверенности.Добавить();
		 СтрИ.Дата = СрокОкончанияДействия;
		 СтрИ.Событие = "Срок действия доверенности окончен";
		 ИсторияДоверенности.Сортировать("Дата");
	КонецЕсли;	
	
	СформироватьЗаголовок();
	
	// Савранин, файлы
	ГиперссылкаФайлов = РаботаСФайлами.ГиперссылкаФайлов();
	ГиперссылкаФайлов.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ГиперссылкаФайлов);
	// Савранин, файлы
	
	// ++ Сербаев 09.06.2023 скрыл команду провести
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаПроведение.Видимость = Ложь;
    // -- Сербаев 09.06.2023       
	ПоказатьСкрытьПечать();  
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСкрытьПечать()   
	
	Если Объект.ВидДоверенности = Перечисления.ЛБ_ВидыДоверенностей.Нотариальная тогда
		Элементы.ПодменюПечать.Видимость = Ложь; 
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство тогда
		Элементы.ПодменюПечать.Видимость = Ложь;	
	иначе
		Элементы.ПодменюПечать.Видимость = Истина;   
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовок()
	ЭтаФорма.Заголовок = "Доверенность";
	Если ЗначениеЗаполнено(Объект.ЗалоговыйБилет) тогда
        ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " к залоговому билету № " + СокрЛП(Объект.ЗалоговыйБилет.НомерЗалоговогоБилета);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + ": Новый";
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура УстановитьДоступность()
	Если Объект.ВидДоверенности = Перечисления.ЛБ_ВидыДоверенностей.Письменная Тогда
		Элементы.ДатаДоверенности.ТолькоПросмотр = Истина;
		Элементы.СрокДействияДоверенности.ТолькоПросмотр = Истина;
		Элементы.СерияДоверенности.Видимость = Ложь;  
		Элементы.НомерДоверенности.Видимость = Ложь;
		Элементы.МестоВыдачи.Видимость = Ложь;
		Элементы.ФИОНотариуса.Видимость = Ложь;
	Иначе          
		Элементы.ДатаДоверенности.ТолькоПросмотр = ложь;
		Элементы.СрокДействияДоверенности.ТолькоПросмотр = ложь; 
		Элементы.СерияДоверенности.Видимость = Истина;  
		Элементы.НомерДоверенности.Видимость = Истина;
		Элементы.МестоВыдачи.Видимость = Истина;
		Элементы.ФИОНотариуса.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура УстановитьДоступностьПоВидуОперации()
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Оформление Тогда 
		Элементы.ГруппаЗалоговыйБилет.Доступность = Истина; 
		Элементы.ГруппаРеквизиты.Доступность = Истина; 
		Элементы.ГруппаДоверенность.Видимость = Ложь;  		
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда  
		Элементы.ГруппаЗалоговыйБилет.Доступность = Истина; 
		Элементы.ГруппаРеквизиты.Доступность = Истина; 
		Элементы.ГруппаДоверенность.Видимость = Ложь;  
		Элементы.СрокДействияДоверенности.Доступность = Ложь;
		Элементы.ВидДоверенности.ТолькоПросмотр = Истина;
	Иначе  		
		Элементы.ГруппаЗалоговыйБилет.Доступность = ложь; 
		Элементы.ГруппаРеквизиты.Доступность = ложь;    
		Элементы.ГруппаДоверенность.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗалоговыйБилетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	СтандартнаяОбработка = ложь;
	Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда 
		Сообщить("Не выбран клиент!");
		Возврат;
	КонецЕсли;	  
		
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Залогодатель", Объект.Клиент); 
	ПараметрыОтбора.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог"));
	 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗалоговогоБилета",ЭтаФорма); 
	ОткрытьФорму("Документ.ЛБ_ОперацияПоЗалогу.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораЗалоговогоБилета(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;	 
	СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(Объект.Дата, Результат);
	Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт тогда 
		Сообщить("Выбранный залоговый билет закрыт. Оформление доверенности не возможно.");
		Возврат;
	КонецЕсли;	

	Объект.ЗалоговыйБилет = Результат;  
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) тогда 
		Объект.Ломбард = Объект.ЗалоговыйБилет.Ломбард;
	КонецЕсли;	
	СформироватьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ВидДоверенностиПриИзменении(Элемент)
	Объект.ДатаДоверенности = Дата(1,1,1); 
	Объект.СрокДействияДоверенности = Дата(1,1,1);  
	Если Объект.ВидДоверенности = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДоверенностей.Письменная") Тогда
		Объект.НомерДоверенности = "";
		Объект.ДатаДоверенности = "";  
		Объект.ДатаДоверенности = НачалоДня(Объект.Дата);
		Объект.СрокДействияДоверенности = ДобавитьМесяц(Объект.ДатаДоверенности, 13);
	КонецЕсли;	
	УстановитьДоступность();
	ПоказатьСкрытьПечать();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)   
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Оформление") Тогда 
		Если Объект.ВидДоверенности = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДоверенностей.Письменная") Тогда 
			Объект.ДатаДоверенности = Объект.Дата;
			Объект.СрокДействияДоверенности = ДобавитьМесяц(Объект.ДатаДоверенности, 13) - 24*60*60;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьКлиентаПоПеречням(Клиент, ДоверенноеЛицо = Ложь)
	РезультатПроверки = Истина; 
	Если ДоверенноеЛицо Тогда 
		НачалоСтроки = "Доверенное лицо найдено ";
	Иначе
		НачалоСтроки = "Доверитель найден ";
	КонецЕсли;	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Залогодатель", Клиент);  
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.ВидПеречня КАК ВидПеречня,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.СтатусКлиентаВПеречне КАК СтатусКлиентаВПеречне,
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ЛБ_КлиентыВПеречнях.СрезПоследних(
	               |			&Дата,
	               |			Залогодатель = &Залогодатель
	               |				И ВидПеречня = &ВидПеречня) КАК ЛБ_КлиентыВПеречняхСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ"; 
	
	СписокПеречней = Новый СписокЗначений;
	СписокПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.Террористы);  
	СписокПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.ФРОМУ);
	СписокПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.МВК);
	СписокПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.ООН);
	
	Для каждого Эл из СписокПеречней Цикл 
		Запрос.УстановитьПараметр("ВидПеречня", Эл.Значение);

		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда     
			Если Выборка.СтатусКлиентаВПеречне = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен Тогда
				Если Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы Тогда
					Сообщить(НачалоСтроки + "в перечне террористов. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
					РезультатПроверки = Ложь;
				ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ Тогда
					Сообщить(НачалоСтроки + "в перечне ФРОМУ. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
					РезультатПроверки = Ложь;
		        ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК Тогда
					Сообщить(НачалоСтроки + "в списке МВК. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
					РезультатПроверки = Ложь;
				ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ООН Тогда
					Сообщить(НачалоСтроки + "в перечне ООН. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
					РезультатПроверки = Ложь;	
				КонецЕсли;	  
			КонецЕсли;
		КонецЕсли;	
	Конеццикла;
	Возврат РезультатПроверки;
КонецФункции	

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)    
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Отзыв ИЛИ Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Ошибка Тогда
		Возврат;
	КонецЕсли;	 
	
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Оформление Тогда
		Если НЕ ПроверитьКлиентаПоПеречням(Объект.Клиент) Тогда 
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;	

	Если ТекущийОбъект.ДатаДоверенности > НачалоДня(ТекущийОбъект.Дата) Тогда 
		Сообщить("Дата выдачи доверенности не может быть больше даты оформления документа доверенности!", СтатусСообщения.Важное);
		Отказ = Истина;	
	КонецЕсли;	  
	Если ТекущийОбъект.ВидДоверенности = Перечисления.ЛБ_ВидыДоверенностей.Письменная И ТекущийОбъект.ДатаДоверенности  < НачалоДня(ТекущийОбъект.ЗалоговыйБилет.Дата) Тогда 
		Сообщить("Дата выдачи письменной доверенности не может быть меньше даты оформления залогового билета!", СтатусСообщения.Важное);
		Отказ = Истина; 
	КонецЕсли;	     
	Если НЕ ТекущийОбъект.СрокДействияДоверенности = Дата(1,1,1) И (ТекущийОбъект.СрокДействияДоверенности < ТекущийОбъект.ДатаДоверенности) Тогда 
		Сообщить("Дата выдачи доверенности не может быть больше даты окончания действия доверенности!", СтатусСообщения.Важное);		
		Отказ = Истина;
	КонецЕсли;	
	Если НЕ ТекущийОбъект.СрокДействияДоверенности = Дата(1,1,1) И (ТекущийОбъект.СрокДействияДоверенности < НачалоДня(ТекущийОбъект.ЗалоговыйБилет.Дата)) Тогда 
		Сообщить("Срок действия доверенности не может быть меньше даты залогового билета!", СтатусСообщения.Важное);		
		Отказ = Истина;
	КонецЕсли;	 

	Если НЕ ПустаяСтрока(ТекущийОбъект.СерияДоверенности) Тогда 
		Если ЛБ_ОбщегоНазначения.ПроверкаВсеСимволыНули(ТекущийОбъект.СерияДоверенности) Тогда
			Сообщить("Серия доверенности не должна содержать только нули.");
            Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	Если НЕ ПустаяСтрока(ТекущийОбъект.НомерДоверенности) Тогда 
		Если ЛБ_ОбщегоНазначения.ПроверкаВсеСимволыНули(ТекущийОбъект.НомерДоверенности) Тогда
			Сообщить("Номер доверенности не должен содержать только нули.");
            Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
	//проверим пользователь = доверитель или доверенное лицо
	Запрос = Новый Запрос;      
	Сотрудник = ЛБ_ОбщийМодуль.ПолучитьСотрудника(ТекущийОбъект.Ответственный);
	Запрос.УстановитьПараметр("Ответственный", Сотрудник);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.Клиент КАК Клиент
	               |ИЗ
	               |	РегистрСведений.ЛБ_СоответствиеКлиентовИСотрудниковОрганизации КАК ЛБ_СоответствиеКлиентовИСотрудниковОрганизации
	               |ГДЕ
	               |	ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.Сотрудник = &Ответственный";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    Отбор = Новый структура;
		Отбор.Вставить("Клиент", объект.Клиент);
		
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если НЕ строки.Количество() = 0 Тогда 
			Сообщить("Сотрудник, оформляющий документ не может быть доверителем!");
            Отказ = Истина;
		Иначе
			Отбор = Новый структура;
			Отбор.Вставить("Клиент", объект.ПредставительКлиента);
			
			Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
			Если НЕ строки.Количество() = 0 Тогда 
				Сообщить("Сотрудник, оформляющий документ не может быть доверенным лицом!");
	            Отказ = Истина;
            КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	    
	
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Оформление Тогда
		//проверим основные документы клиента
		РезультатПроверки = ЛБ_УправлениеЛомбардом.ПроверитьОсновныеДокументыЗалогодателя(Объект.Клиент, Объект.Дата);
		Если НЕ ПустаяСтрока(РезультатПроверки.ОшибкаДУЛ) Тогда
			Сообщить("Проверка основного ДУЛ доверителя: " + РезультатПроверки.ОшибкаДУЛ);
		    Отказ = Истина;
		КонецЕсли; 
		Если НЕ ПустаяСтрока(РезультатПроверки.ОшибкаДоп) Тогда
			Сообщить("Проверка основного документа на право пребывания РФ доверителя: " + РезультатПроверки.ОшибкаДоп);
		    Отказ = Истина;
		КонецЕсли;   
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьЕстьДатаСмерти(Клиент)
	Возврат ЛБ_ОбщийМодуль.ПроверитьЕстьДатаСмерти(Клиент, Объект.Дата);
КонецФункции			

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Отзыв") ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Ошибка") Тогда
		Возврат;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;	
	Если Объект.Клиент = Объект.ПредставительКлиента Тогда 
		Сообщить("Доверитель не может быть одновременно своим доверенным лицом.", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	// ++ Сербаев 16.06.2023
	ВозрастДоверенногоЛица = ВозрастДоверенногоЛица(Объект.ПредставительКлиента);
	Если Не ВозрастДоверенногоЛица = Неопределено Тогда
		Если (ВозрастДоверенногоЛица < 18) И НЕ (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Наследство")) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Доверенное лицо не может быть моложе 18 лет!'"), , , "Объект.ПредставительКлиента");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	// -- Сербаев 16.06.2023
	Если Объект.ВидДоверенности = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДоверенностей.Нотариальная") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.НомерДоверенности) Тогда
			// ++ Сербаев 13.06.2023
			//Сообщить("Не заполнен номер ноториальной доверенности.", СтатусСообщения.Важное);
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнен номер нотариальной доверенности.'"), , , "Объект.НомерДоверенности");
			// -- Сербаев 13.06.2023
			Отказ = Истина; 
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(Объект.СрокДействияДоверенности)  Тогда 
			ТекстВопроса = "Будет установлен срок действия доверенности один год. Продолжить?";
            Ответ = Вопрос(ТекстВопроса,РежимДиалогаВопрос.ДаНет,20,КодВозвратаДиалога.Нет,,КодВозвратаДиалога.Нет);
            Если Не Ответ=КодВозвратаДиалога.Да Тогда
                Отказ = Истина;  
			Иначе
				 Объект.СрокДействияДоверенности = ДобавитьМесяц(Объект.ДатаДоверенности, 12);
			 КонецЕсли;
		 КонецЕсли;	 
		 // ++ Сербаев 13.06.2023
		 Если ЗначениеЗаполнено(Объект.СрокДействияДоверенности) Тогда
			 Если Объект.СрокДействияДоверенности < НачалоДня(Объект.Дата) Тогда
				 ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Срок окончания действия доверенности не может быть меньше текущей даты.'"), , , "Объект.СрокДействияДоверенности");
				 Отказ = Истина;
			 КонецЕсли;
		 КонецЕсли;
		 // -- Сербаев 13.06.2023  
	 ИначеЕсли Объект.ВидДоверенности = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДоверенностей.СвидетельствоОСмерти") Тогда   
		 Если НЕ ЗначениеЗаполнено(Объект.СерияДоверенности) Тогда
			// ++ Сербаев 13.06.2023
			//Сообщить("Не заполнен номер ноториальной доверенности.", СтатусСообщения.Важное);
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнена серия.'"), , , "Объект.СерияДоверенности");
			// -- Сербаев 13.06.2023
			Отказ = Истина;      
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(Объект.НомерДоверенности) Тогда
			// ++ Сербаев 13.06.2023
			//Сообщить("Не заполнен номер ноториальной доверенности.", СтатусСообщения.Важное);
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнен номер.'"), , , "Объект.НомерДоверенности");
			// -- Сербаев 13.06.2023
			Отказ = Истина;      
		КонецЕсли;		 
	КонецЕсли;	
	Если НЕ Объект.ВидДоверенности = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДоверенностей.Письменная") Тогда
	    Если НЕ ЗначениеЗаполнено(Объект.МестоВыдачи) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнено место выдачи нотариальной доверенности.'"), , , "Объект.МестоВыдачи");
			Отказ = Истина; 
		КонецЕсли;	
	    Если НЕ ЗначениеЗаполнено(Объект.ФИОНотариуса) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнены ФИО нотариуса, выдавшего нотариальную доверенность.'"), , , "Объект.ФИОНотариуса");
			Отказ = Истина;
		 КонецЕсли;
     КонецЕсли;
	 Если НЕ Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Наследство") Тогда
	     ДатаСмертиКлиента = ПроверитьЕстьДатаСмерти(Объект.Клиент);
		 Если НЕ ДатаСмертиКлиента = неопределено Тогда 
			Сообщить("Найдено свидетельство о смерти доверителя. Дата смерти " + Формат(ДатаСмертиКлиента, "ДЛФ=DD")); 
			Отказ = Истина;
		 КонецЕсли;	  
	 Иначе
		  ДатаСмертиКлиента = ПроверитьЕстьДатаСмерти(Объект.Клиент);
		  Если Объект.ДатаДоверенности < ДатаСмертиКлиента Тогда  
			  Сообщить("Дата выдачи свидетельства о праве на наследство не может быть меньше даты смерти клиента " + Формат(ДатаСмертиКлиента, "ДЛФ=DD")); 
			  Отказ = Истина;
		  КонецЕсли;	  
	 КонецЕсли;	
	 ДатаСмертиПредставителя = ПроверитьЕстьДатаСмерти(Объект.ПредставительКлиента);
	 Если НЕ ДатаСмертиПредставителя = неопределено Тогда 
		 Сообщить("Найдено свидетельство о смерти доверенного лица. Дата смерти " + Формат(ДатаСмертиПредставителя, "ДЛФ=DD")); 
		 Отказ = Истина;
	 КонецЕсли;	
КонецПроцедуры    

&НаСервере
Процедура ОчиститьРеквизиты()
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Оформление") Тогда
		Объект.ОтзываемаяДоверенность = Документы.ЛБ_Доверенности.ПустаяСсылка();
	Иначе
		Объект.ВидДоверенности = Перечисления.ЛБ_ВидыДоверенностей.ПустаяСсылка();		
		Объект.ЗалоговыйБилет = Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
		Объект.Клиент = Справочники.ЛБ_Залогодатели.ПустаяСсылка();
		Объект.ПредставительКлиента = Справочники.ЛБ_Залогодатели.ПустаяСсылка();
		Объект.ДатаДоверенности = Дата(1,1,1);
		Объект.НомерДоверенности = "";
		Объект.СерияДоверенности = "";
		Объект.СрокДействияДоверенности = Дата(1,1,1);  
		Объект.Комментарий = ""; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьДоступностьПоВидуОперации();
	ОчиститьРеквизиты();
КонецПроцедуры

&НаСервере
Процедура УстановитьРеквизитыПоДоверенности()
	Объект.ВидДоверенности              = Объект.ОтзываемаяДоверенность.ВидДоверенности;		
	Объект.ЗалоговыйБилет               = Объект.ОтзываемаяДоверенность.ЗалоговыйБилет; 
	Объект.Клиент                       = Объект.ОтзываемаяДоверенность.Клиент;
	Объект.ДокументКлиента              = Объект.ОтзываемаяДоверенность.ДокументКлиента;
	Объект.ПредставительКлиента         = Объект.ОтзываемаяДоверенность.ПредставительКлиента;
	Объект.ДокументПредставителяКлиента = Объект.ОтзываемаяДоверенность.ДокументПредставителяКлиента;
	// ++ Сербаев 06.07.2023
	ДокументКлиентаПолноеНаименование              = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОтзываемаяДоверенность.ДокументКлиента, "НаименованиеПолное");
	ДокументПредставителяКлиентаПолноеНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОтзываемаяДоверенность.ДокументПредставителяКлиента, "НаименованиеПолное");
    // -- Сербаев 06.07.2023
	Объект.ДатаДоверенности         = Объект.ОтзываемаяДоверенность.ДатаДоверенности;
	Объект.НомерДоверенности        = Объект.ОтзываемаяДоверенность.НомерДоверенности;
	Объект.СерияДоверенности        = Объект.ОтзываемаяДоверенность.СерияДоверенности;
	Объект.СрокДействияДоверенности = Объект.ОтзываемаяДоверенность.СрокДействияДоверенности;  
	Объект.Комментарий              = Объект.ОтзываемаяДоверенность.Комментарий; 
КонецПроцедуры

&НаКлиенте
Процедура ОтзываемаяДоверенностьПриИзменении(Элемент)
	УстановитьРеквизитыПоДоверенности();
КонецПроцедуры

&НаКлиенте
Процедура ОтзываемаяДоверенностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораДоверенности",ЭтаФорма);
		  	
	ПараметрыОтбора = Новый Структура;  
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
	    ПараметрыОтбора.Вставить("Клиент", Объект.Клиент);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ЗалоговыйБилет) Тогда 
	    ПараметрыОтбора.Вставить("ЗалоговыйБилет", Объект.ЗалоговыйБилет);
	КонецЕсли;	
	
	Если ПараметрыОтбора.Количество() = 0 Тогда
		ОткрытьФорму("Документ.ЛБ_Доверенности.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
		 
		ОткрытьФорму("Документ.ЛБ_Доверенности.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;	
КонецПроцедуры   

&НаСервере
Процедура ПослеВыбораДоверенности(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;	
	Объект.ОтзываемаяДоверенность = Результат; 
	УстановитьРеквизитыПоДоверенности();
КонецПроцедуры

&НаКлиенте
Процедура ПредставительКлиентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	СтандартнаяОбработка = ложь;
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Объект.ПредставительКлиента) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Объект.ПредставительКлиента);
	КонецЕсли;	
	ПараметрыФормы.Вставить("Дата", Объект.Дата);  
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		ПараметрыФормы.Вставить("НаТекущуюДату", Истина);  
	Иначе
		ПараметрыФормы.Вставить("НаТекущуюДату", Ложь); 
		ПараметрыФормы.Вставить("НеРедактировать", Истина); 
	КонецЕсли;	
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПредставителя",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры     

&НаКлиенте
Процедура ПослеВыбораПредставителя(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Объект.ПредставительКлиента = Результат.Залогодатель; 
	Объект.ДокументПредставителяКлиента = Результат.ДокументЗалогодателя;
	// ++ Сербаев 06.07.2023
	ДокументПредставителяКлиентаПолноеНаименование = ЗначениеРеквизитаОбъекта(Результат.ДокументЗалогодателя, "НаименованиеПолное");
    // -- Сербаев 06.07.2023
КонецПроцедуры

&НаКлиенте
Процедура КлиентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Объект.Клиент);
	КонецЕсли;
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКлиента",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКлиента(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Объект.Клиент = Результат.Залогодатель;  
	Объект.ДокументКлиента = Результат.ДокументЗалогодателя;
	// ++ Сербаев 06.07.2023
	ДокументКлиентаПолноеНаименование = ЗначениеРеквизитаОбъекта(Результат.ДокументЗалогодателя, "НаименованиеПолное");
    // -- Сербаев 06.07.2023   
	Если НЕ ПроверитьЕстьДатаСмерти(Объект.Клиент) = неопределено Тогда 
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Наследство");
		Объект.ВидДоверенности = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДоверенностей.СвидетельствоОСмерти"); 
		Элементы.ВидОперации.ТолькоПросмотр = Истина; 
		УстановитьДоступностьПоВидуОперации(); 
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Наследство") Тогда
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Оформление");
		Объект.ВидДоверенности = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДоверенностей.Письменная"); 
		Элементы.ВидОперации.ТолькоПросмотр = ложь; 
		УстановитьДоступностьПоВидуОперации(); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДокументКлиентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Объект.Клиент); 
		ПараметрыФормы.Вставить("ТолькоДокументы", Истина);
	КонецЕсли;	  
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКлиента",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаКлиенте
Процедура ДокументПредставителяКлиентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Объект.ПредставительКлиента) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Объект.ПредставительКлиента);
	КонецЕсли;	  
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПредставителя",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Савранин, файлы
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Савранин, файлы
	
	 // ++ Сербаев 06.07.2023
	Если ЗначениеЗаполнено(Объект.ДокументКлиента) Тогда
	    ДокументКлиентаПолноеНаименование = ЗначениеРеквизитаОбъекта(Объект.ДокументКлиента, "НаименованиеПолное");
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ДокументПредставителяКлиента) Тогда
	    ДокументПредставителяКлиентаПолноеНаименование = ЗначениеРеквизитаОбъекта(Объект.ДокументПредставителяКлиента, "НаименованиеПолное");
	КонецЕсли;
    // -- Сербаев 06.07.2023
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Савранин, файлы
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия); 
	// Савранин, файлы
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
    // Савранин, файлы
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
    // Савранин, файлы
КонецПроцедуры

&НаСервере
Функция ВозрастДоверенногоЛица(ДоверенноеЛицо)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения
		|ИЗ
		|	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&ДатаСреза, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Залогодатель", ДоверенноеЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = ЛБ_ОбщийМодуль.ВычислитьВозраст(Выборка.ДатаРождения);
	КонецЕсли;;
	
	Возврат Результат;
	
КонецФункции     

&НаСервере
Функция ПолучитьДатуРождения(Клиент)
	
	Результат = Дата(1,1,1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения
		|ИЗ
		|	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&ДатаСреза, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Залогодатель", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ДатаРождения;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


// ++ Сербаев 06.07.2023
&НаКлиенте
Процедура ДокументКлиентаПолноеНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Объект.Клиент); 
		ПараметрыФормы.Вставить("ТолькоДокументы", Истина);
	КонецЕсли;	  
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКлиента",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДокументПредставителяКлиентаПолноеНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Объект.ПредставительКлиента) Тогда
		ПараметрыФормы.Вставить("Залогодатель", Объект.ПредставительКлиента);
	КонецЕсли;	  
	ПараметрыФормы.Вставить("Дата", Объект.Дата);  
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		ПараметрыФормы.Вставить("НаТекущуюДату", Истина);  		
	Иначе
		ПараметрыФормы.Вставить("НаТекущуюДату", Ложь);   
		ПараметрыФормы.Вставить("НеРедактировать", Истина);  
	КонецЕсли;	
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПредставителя",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита)
    Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
КонецФункции
// -- Сербаев 06.07.2023
